susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32WB55x.h
#define SYS_TRACED0_PD9_ PD9,GPIO_AF0
#define _SYS_TRACED0_PD9_ 1

#define SYS_TRACED1_PC10_ PC10,GPIO_AF0
#define _SYS_TRACED1_PC10_ 1

#define SYS_TRACED2_PD2_ PD2,GPIO_AF0
#define _SYS_TRACED2_PD2_ 1

#define SYS_TRACED3_PC12_ PC12,GPIO_AF0
#define _SYS_TRACED3_PC12_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF14
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF14
#define TIM16_CH1_PB8_ PB8,GPIO_AF14
#define TIM16_CH1_PE0_ PE0,GPIO_AF14
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF14
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF14
#define TIM17_BKIN_PB4_ PB4,GPIO_AF14
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF14
#define TIM17_CH1_PB9_ PB9,GPIO_AF14
#define TIM17_CH1_PE1_ PE1,GPIO_AF14
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF14
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_PB12_ PB12,GPIO_AF3
#define TIM1_BKIN_PB7_ PB7,GPIO_AF3
#define TIM1_BKIN_PC9_ PC9,GPIO_AF3
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PB7_ 1
#define _TIM1_BKIN_PC9_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF12
#define TIM1_BKIN2_PD8_ PD8,GPIO_AF2
#define _TIM1_BKIN2_PA11_ 1
#define _TIM1_BKIN2_PD8_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PD14_ PD14,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PD14_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PD15_ PD15,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PD15_ 1

#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PB8_ PB8,GPIO_AF1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PB8_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define _TIM1_CH3_PA10_ 1

#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PB9_ PB9,GPIO_AF1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PB9_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define _TIM1_CH4_PA11_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE0_ PE0,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE0_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TRIG_INOUT_PD10_ PD10,GPIO_AF0
#define _TRIG_INOUT_PD10_ 1

#define TSC_G1_IO1_PB12_ PB12,GPIO_AF9
#define _TSC_G1_IO1_PB12_ 1

#define TSC_G1_IO2_PB13_ PB13,GPIO_AF9
#define _TSC_G1_IO2_PB13_ 1

#define TSC_G1_IO3_PB14_ PB14,GPIO_AF9
#define _TSC_G1_IO3_PB14_ 1

#define TSC_G1_IO4_PB15_ PB15,GPIO_AF9
#define _TSC_G1_IO4_PB15_ 1

#define TSC_G2_IO1_PB4_ PB4,GPIO_AF9
#define _TSC_G2_IO1_PB4_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15_ PA15,GPIO_AF9
#define _TSC_G3_IO1_PA15_ 1

#define TSC_G3_IO2_PC10_ PC10,GPIO_AF9
#define _TSC_G3_IO2_PC10_ 1

#define TSC_G3_IO3_PC11_ PC11,GPIO_AF9
#define _TSC_G3_IO3_PC11_ 1

#define TSC_G3_IO4_PC12_ PC12,GPIO_AF9
#define _TSC_G3_IO4_PC12_ 1

#define TSC_G4_IO1_PC6_ PC6,GPIO_AF9
#define _TSC_G4_IO1_PC6_ 1

#define TSC_G4_IO2_PC7_ PC7,GPIO_AF9
#define _TSC_G4_IO2_PC7_ 1

#define TSC_G4_IO3_PC8_ PC8,GPIO_AF9
#define _TSC_G4_IO3_PC8_ 1

#define TSC_G4_IO4_PC9_ PC9,GPIO_AF9
#define _TSC_G4_IO4_PC9_ 1

#define TSC_G5_IO1_PD4_ PD4,GPIO_AF9
#define _TSC_G5_IO1_PD4_ 1

#define TSC_G5_IO2_PD5_ PD5,GPIO_AF9
#define _TSC_G5_IO2_PD5_ 1

#define TSC_G5_IO3_PD6_ PD6,GPIO_AF9
#define _TSC_G5_IO3_PD6_ 1

#define TSC_G5_IO4_PD7_ PD7,GPIO_AF9
#define _TSC_G5_IO4_PD7_ 1

#define TSC_G6_IO1_PD10_ PD10,GPIO_AF9
#define _TSC_G6_IO1_PD10_ 1

#define TSC_G6_IO2_PD11_ PD11,GPIO_AF9
#define _TSC_G6_IO2_PD11_ 1

#define TSC_G6_IO3_PD12_ PD12,GPIO_AF9
#define _TSC_G6_IO3_PD12_ 1

#define TSC_G6_IO4_PD13_ PD13,GPIO_AF9
#define _TSC_G6_IO4_PD13_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF9
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE1_ PE1,GPIO_AF9
#define _TSC_G7_IO2_PE1_ 1

#define TSC_G7_IO3_PE0_ PE0,GPIO_AF9
#define _TSC_G7_IO3_PE0_ 1

#define TSC_G7_IO4_PB9_ PB9,GPIO_AF9
#define _TSC_G7_IO4_PB9_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF9
#define TSC_SYNC_PD2_ PD2,GPIO_AF9
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PD2_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4_ PB4,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3_ PB3,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PB4_ PB4,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PB4_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3_ PB3,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CTS_PA6_ PA6,GPIO_AF8
#define UART2_CTS_PB13_ PB13,GPIO_AF8
#define _UART2_CTS_PA6_ 1
#define _UART2_CTS_PB13_ 1

#define UART2_DE_PB1_ PB1,GPIO_AF8
#define UART2_DE_PB12_ PB12,GPIO_AF8
#define _UART2_DE_PB1_ 1
#define _UART2_DE_PB12_ 1

#define UART2_RTS_PB1_ PB1,GPIO_AF8
#define UART2_RTS_PB12_ PB12,GPIO_AF8
#define _UART2_RTS_PB1_ 1
#define _UART2_RTS_PB12_ 1

#define UART2_RX_PA12_ PA12,GPIO_AF8
#define UART2_RX_PA3_ PA3,GPIO_AF8
#define UART2_RX_PB10_ PB10,GPIO_AF8
#define UART2_RX_PC0_ PC0,GPIO_AF8
#define _UART2_RX_PA12_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PB10_ 1
#define _UART2_RX_PC0_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF8
#define UART2_TX_PB11_ PB11,GPIO_AF8
#define UART2_TX_PB5_ PB5,GPIO_AF8
#define UART2_TX_PC1_ PC1,GPIO_AF8
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB11_ 1
#define _UART2_TX_PB5_ 1
#define _UART2_TX_PC1_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4_ PB4,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3_ PB3,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define USART1_NSS_PB4_ PB4,GPIO_AF7
#define _USART1_NSS_PA11_ 1
#define _USART1_NSS_PB4_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3_ PB3,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USB_DM_PA11_ PA11,GPIO_AF10
#define _USB_DM_PA11_ 1

#define USB_DP_PA12_ PA12,GPIO_AF10
#define _USB_DP_PA12_ 1

#define USB_NOE_PA13_ PA13,GPIO_AF10
#define USB_NOE_PC9_ PC9,GPIO_AF10
#define _USB_NOE_PA13_ 1
#define _USB_NOE_PC9_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */